---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePattern
source: html/462938fb-03b7-473b-36e3-856fe95dc519.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePattern Property

"Tile Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfacePattern { get; }
```